{
  "_name_or_path": "LLM360/CrystalCoder",
  "activation_function": "swiglu",
  "architectures": [
    "CrystalCoderLMHeadModel"
  ],
  "attn_pdrop": 0.0,
  "auto_map": {
    "AutoConfig": "LLM360/CrystalCoder--configuration_crystalcoder.CrystalCoderConfig",
    "AutoModel": "LLM360/CrystalCoder--modeling_crystalcoder.CrystalCoderModel",
    "AutoModelForCausalLM": "LLM360/CrystalCoder--modeling_crystalcoder.CrystalCoderLMHeadModel"
  },
  "bos_token_id": 1,
  "embd_pdrop": 0.0,
  "eos_token_id": 2,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "crystalcoder",
  "mup_embeddings_scale": 14.6,
  "mup_output_alpha": 2.22,
  "mup_scale_qk_dot_by_d": true,
  "mup_width_scale": 0.0625,
  "n_embd": 1024,
  "n_head": 32,
  "n_inner": 10922,
  "n_layer": 32,
  "n_positions": 2048,
  "position_embedding_type": "rotary",
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.0,
  "rotary_dim": 32,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.31.0",
  "use_cache": true,
  "vocab_size": 32032
}
